
#Вводимо константи
INCH = 2.54
LB = 0.45359237
#Знайомство з користувачем
print('Вас вітає калькулятор IMT')
name = str(input("Введіть ваше ім'я: "))
print(f'{name}, вам потрібно обрати системи вимірювання та ввести ваши показники!')
#Додавання зросту
print('Оберіть систему вимірювання зросту:')
method_h = str(input('sm для сантіметрів, inch для дюймів: '))
while method_h not in ('sm', 'inch'):
    print('Не корректне введення!')
    method_h = str(input('sm для сантіметрів, inch для дюймів: '))
height_add = int(input('Введіть ваш зріст в обраній системі вимірювання: '))
if method_h == 'inch':
    height = round(((height_add * INCH) / 100),2)
elif method_h == 'sm':
    height = height_add / 100
#Додавання ваги
print('Оберіть систему вимірювання ваги:')
method_w = str(input('kg для кілограмів, lb для фунтів: '))
while method_w not in ('kg','lb'):
    print('Не корректне введення!')
    method_w = str(input('kg для кілограмів, lb для фунтів: '))
weihgt_add = int(input('Введіть вашу вагу в обраній системі вимірювання: '))
if method_w == 'lb':
    weight = weihgt_add * LB
elif method_w == 'kg':
    weight = weihgt_add
#Вимірювання IMT
# print(height)
# print(weight)
imt = weight / (height**2)
print(f'{name}, враховующи введені данні, ваш IMT = {imt:.2f}')
if imt < 18.5:
    print('Ваш IMT свідчить про недостатню вагу, що може призвести до ймовірності розвитку бронхо-легеневих захворювань')
elif 18.5 <= imt <= 24.9:
    print("Ваш IMT знаходиться в зоні здорового ризику щодо розвитку захворювань, пов'язаних з ожирінням.")
elif 25.0 <= imt <= 29.9:
    print('Ваш IMT свідчить про надлишкову вагу, що може призвести до ймовірності розвитку сердцево-судинних захворювань')
elif 30.0 <= imt <= 34.9:
    print('Ваш IMT свідчить про наявність ожиріння I ступеня.')
elif 35.0 <= imt <= 39.9:
    print('Ваш IMT свідчить про наявність ожиріння II ступеня.')
elif imt >= 40:
    print('Ваш IMT свідчить про наявність ожиріння III ступеня.')